<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <meta http-equiv="X-UA-Compatible" content="IE=edge" >
  <title>博客开张 | Frapples的博客</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x4E2D;&amp;#x79CB;&amp;#x524D;&amp;#x540E;&amp;#xFF0C;&amp;#x5229;&amp;#x7528; hexo &amp;#x5DE5;&amp;#x5177;&amp;#x548C; github&amp;#xFF0C;&amp;#x7EC8;&amp;#x4E8E;&amp;#x628A;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x535A;&amp;#x5BA2;&amp;#x7ED9;&amp;#x642D;&amp;#x5EFA;&amp;#x8D77;&amp;#">
<meta property="og:type" content="article">
<meta property="og:title" content="博客开张">
<meta property="og:url" content="http://frapples.github.io/2016/09/17/blog-starting/index.html">
<meta property="og:site_name" content="Frapples的博客">
<meta property="og:description" content="&amp;#x4E2D;&amp;#x79CB;&amp;#x524D;&amp;#x540E;&amp;#xFF0C;&amp;#x5229;&amp;#x7528; hexo &amp;#x5DE5;&amp;#x5177;&amp;#x548C; github&amp;#xFF0C;&amp;#x7EC8;&amp;#x4E8E;&amp;#x628A;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x535A;&amp;#x5BA2;&amp;#x7ED9;&amp;#x642D;&amp;#x5EFA;&amp;#x8D77;&amp;#">
<meta property="og:updated_time" content="2016-09-17T09:48:53.443Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="博客开张">
<meta name="twitter:description" content="&amp;#x4E2D;&amp;#x79CB;&amp;#x524D;&amp;#x540E;&amp;#xFF0C;&amp;#x5229;&amp;#x7528; hexo &amp;#x5DE5;&amp;#x5177;&amp;#x548C; github&amp;#xFF0C;&amp;#x7EC8;&amp;#x4E8E;&amp;#x628A;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x535A;&amp;#x5BA2;&amp;#x7ED9;&amp;#x642D;&amp;#x5EFA;&amp;#x8D77;&amp;#">
  
    <link rel="alternative" href="/atom.xml" title="Frapples的博客" type="application/atom+xml">
  
  
    <link rel="icon" href="//favicon.png">
  
  <script src="/style.js"></script>
</head>

<body>
  <div id="container">
    <div class="left-col">
      <div class="overlay"></div>
<div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img src="/images/logo.jpg" class="js-avatar">
			
		</a>

		<hgroup>
		  <h1 class="header-author"><a href="/">Frapples</a></h1>
		</hgroup>

		
		<p class="header-subtitle">个人的一片小天地，整理思绪，思考问题，分享心得:)</p>
		

		<nav class="header-menu">
			<ul>
			
				<li><a href="/">主页</a></li>
	        
				<li><a href="/archives">博文归档</a></li>
	        
			</ul>
		</nav>
		<nav class="header-smart-menu">
	        
    		
    			
    			<a class="js-smart-menu" data-idx="0" href="javascript:void(0)">文章列表</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="1" href="javascript:void(0)">标签</a>
    			
    			
            
    			
            
    			
    			<a class="js-smart-menu" data-idx="2" href="javascript:void(0)">关于我</a>
    			
    			
            
		</nav>
		<nav class="header-nav">
			<div class="social">
				
					<a class="github" target="_blank" href="https://www.github.com/" title="github">github</a>
		        
			</div>
		</nav>
	</header>		
</div>

    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  	<div class="overlay">
  		<div class="slider-trigger"><i class="icon-list"></i></div>
  		<h1 class="header-author js-mobile-header hide">Frapples</h1>
  	</div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
				
					<img src="/images/logo.jpg" class="js-avatar">
				
			</div>
			<hgroup>
			  <h1 class="header-author">Frapples</h1>
			</hgroup>
			
			<p class="header-subtitle">个人的一片小天地，整理思绪，思考问题，分享心得:)</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives">博文归档</a></li>
		        
				</ul>
			</nav>
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="https://www.github.com/" title="github">github</a>
			        
				</div>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap">
        <article id="post-blog-starting" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      博客开张
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>
&#x4E2D;&#x79CB;&#x524D;&#x540E;&#xFF0C;&#x5229;&#x7528; hexo &#x5DE5;&#x5177;&#x548C; github&#xFF0C;&#x7EC8;&#x4E8E;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x535A;&#x5BA2;&#x7ED9;&#x642D;&#x5EFA;&#x8D77;&#x6765;&#x4E86;&#x3002;
&#x65F6;&#x95F4;&#x8FC7;&#x7684;&#x53EF;&#x771F;&#x5FEB;&#xFF0C;&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x7684;&#x5DF2;&#x7ECF;&#x8E0F;&#x5165;&#x5927;&#x5B66;&#x4E09;&#x5E74;&#x4E86;&#x3002;
&#x5176;&#x5B9E;&#x65E9;&#x5728;&#x5927;&#x4E8C;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5C31;&#x6709;&#x642D;&#x5EFA;&#x535A;&#x5BA2;&#x7684;&#x60F3;&#x6CD5;&#x4E86;&#x3002;
&#x53EF;&#x90A3;&#x65F6;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x6211;&#x8EAB;&#x4E0A;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x7684;&#x95EE;&#x9898;&#x8981;&#x53BB;&#x89E3;&#x51B3;&#x3002;
&#x800C;&#x4E14;&#x6211;&#x81EA;&#x5DF1;&#x53C8;&#x592A;&#x61D2;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E8B;&#xFF0C;&#x5C31;&#x4E00;&#x76F4;&#x62D6;&#x7740;&#x4E86;&#x3002;
</p>

<p>
&#x524D;&#x51E0;&#x5929;&#x5728;&#x6574;&#x7406;&#x81EA;&#x5DF1;&#x7684;&#x7B14;&#x8BB0;&#xFF0C;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x591A;&#x4E86;&#x8BB8;&#x591A;&#x7075;&#x611F;&#x3002;
&#x4E8E;&#x662F;&#x5C31;&#x501F;&#x7740;&#x8FD9;&#x6CE2;&#x52B2;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x535A;&#x5BA2;&#x7ED9;&#x642D;&#x5EFA;&#x8D77;&#x6765;&#x4E86;&#x3002;
&#x4EE5;&#x540E;&#x8FD9;&#x91CC;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x9759;&#x8C27;&#x4E4B;&#x5730;&#xFF0C;&#x80FD;&#x8BA9;&#x6211;&#x6682;&#x65F6;&#x8FDC;&#x79BB;&#x5C18;&#x4E16;&#x7684;&#x55A7;&#x56A3;&#x548C;&#x6D6E;&#x8E81;&#xFF0C;&#x76F4;&#x9762;&#x5185;&#x5FC3;&#x7684;&#x81EA;&#x5DF1;&#x3002;
&#x6211;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x5B89;&#x9759;&#x7684;&#x6DF1;&#x5165;&#x601D;&#x8003;&#x95EE;&#x9898;&#xFF0C;&#x6574;&#x7406;&#x601D;&#x7EEA;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x5206;&#x4EAB;&#x4E00;&#x4E9B;&#x4E2A;&#x4EBA;&#x7684;&#x5C0F;&#x5FC3;&#x5F97;&#x548C;&#x6D45;&#x8584;&#x7684;&#x89C1;&#x89E3;&#x3002;
</p>

<p>
&#x611F;&#x8C22;&#x8FD9;&#x4E9B;&#x5E74;&#x6765;&#x4E00;&#x76F4;&#x9ED8;&#x9ED8;&#x652F;&#x6301;&#x6211;&#x7684;&#x670B;&#x53CB;&#x4EEC;&#xFF0C;&#x795D;&#x613F;&#x6211;&#x4EEC;&#x7684;&#x660E;&#x5929;&#x5C06;&#x4F1A;&#x66F4;&#x7F8E;&#x597D;&#x3002;
</p>

<a id="more"></a>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> &#x535A;&#x5BA2;&#x53EF;&#x4EE5;&#x505A;&#x4EC0;&#x4E48;</h2>
<div class="outline-text-2" id="text-1">
<p>
&#x535A;&#x5BA2;&#x7ED9;&#x81EA;&#x5DF1;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5B89;&#x9759;&#x7684;&#x573A;&#x6240;&#xFF0C;&#x8BA9;&#x6211;&#x80FD;&#x591F;&#x76F4;&#x9762;&#x5185;&#x5FC3;&#x7684;&#x6574;&#x7406;&#x81EA;&#x5DF1;&#xFF0C;&#x601D;&#x8003;&#x95EE;&#x9898;&#x3002;
</p>

<p>
&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6211;&#x53D1;&#x73B0;&#xFF0C; <b>&#x60F3;</b> &#x548C; <b>&#x5199;</b> &#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x3002;
&#x6211;&#x7ECF;&#x5E38;&#x5927;&#x8111;&#x91CC;&#x5929;&#x9A6C;&#x884C;&#x7A7A;&#x7684;&#x60F3;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x8C8C;&#x4F3C;&#x975E;&#x5E38;&#x597D;&#x5F88;&#x65E0;&#x61C8;&#x53EF;&#x51FB;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x3002;
&#x4F46;&#x662F;&#x7B49;&#x5230;&#x6211;&#x505A;&#x7B14;&#x8BB0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x624D;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x6211;&#x4E4B;&#x524D;&#x5FFD;&#x7565;&#x4E86;&#x597D;&#x591A;&#x597D;&#x591A;&#x7684;&#x7EC6;&#x8282;&#x3002;
&#x8FD9;&#x79CD;&#x9519;&#x89C9;&#xFF0C;&#x5927;&#x6982;&#x5C31;&#x662F;&#x5927;&#x5BB6;&#x6240;&#x8BF4;&#x7684;&#x7684;&#x773C;&#x9AD8;&#x624B;&#x4F4E;&#x5427;&#x3002;
</p>

<p>
&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x535A;&#x5BA2;&#x53EF;&#x4EE5;&#x62FF;&#x6765;&#x6574;&#x7406;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x7EEA;&#xFF0C;&#x66F4;&#x6DF1;&#x5165;&#x7684;&#x601D;&#x8003;&#x95EE;&#x9898;&#x3002;
&#x5728;&#x4F60;&#x7A81;&#x7136;&#x6709;&#x4E86;&#x5F88;&#x591A;&#x60F3;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x59A8;&#x8BD5;&#x7740;&#x5C06;&#x5B83;&#x6574;&#x7406;&#x6210;&#x4E00;&#x7BC7;&#x535A;&#x6587;&#xFF0C;&#x7EDD;&#x5BF9;&#x6BD4;&#x4F60;&#x7A7A;&#x60F3;&#x6765;&#x7684;&#x8981;&#x6DF1;&#x5165;&#x3002;
</p>


<p>
&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x4EBA;&#x751F;&#x4E4B;&#x8DEF;&#x90FD;&#x5C11;&#x4E0D;&#x4E86;&#x522B;&#x4EBA;&#x7684;&#x5E2E;&#x52A9;&#x3002;&#x6211;&#x5728;&#x78B0;&#x5230;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#x7ECF;&#x5E38;&#x6C42;&#x52A9;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#xFF0C;
&#x6211;&#x53D1;&#x73B0;&#xFF0C;&#x6BCF;&#x6B21;&#x5BF9;&#x6211;&#x5E2E;&#x52A9;&#x5F88;&#x5927;&#x7684;&#xFF0C;&#x9664;&#x4E86;&#x5B98;&#x65B9;&#x6587;&#x6863;&#xFF0C;&#x5C31;&#x662F;&#x5176;&#x5B83;&#x535A;&#x4E3B;&#x7684;&#x535A;&#x6587;&#x4E86;&#x3002;
&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x65B0;&#x624B;&#xFF0C;&#x6211;&#x975E;&#x5E38;&#x611F;&#x8C22;&#x4ED6;&#x4EEC;&#x80FD;&#x82B1;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x5927;&#x91CF;&#x7684;&#x53E3;&#x6C34;&#x5728;&#x535A;&#x6587;&#x7684;&#x7EC6;&#x7EC6;&#x7684;&#x89E3;&#x91CA;&#x3002;
&#x535A;&#x5BA2;&#x4E5F;&#x662F;&#x5206;&#x4EAB;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E92;&#x76F8;&#x5206;&#x4EAB;&#x80FD;&#x52A0;&#x901F;&#x77E5;&#x8BC6;&#x7684;&#x5B66;&#x4E60;&#x3002;
&#x867D;&#x7136;&#x6211;&#x7684;&#x6C34;&#x5E73;&#x8FD8;&#x8C08;&#x4E0D;&#x4E0A;&#x4EC0;&#x4E48;&#x5206;&#x4EAB;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5E0C;&#x671B;&#x4F1A;&#x5BF9;&#x4E00;&#x4E9B;&#x4EBA;&#x6709;&#x7528;&#x5427;&#x3002;
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> &#x535A;&#x5BA2;&#x7684;&#x4F18;&#x52BF;</h2>
<div class="outline-text-2" id="text-2">
<p>
&#x73B0;&#x5728;&#x7684;&#x7F51;&#x7EDC;&#x6280;&#x672F;&#x9AD8;&#x901F;&#x53D1;&#x5C55;&#x7684;&#x4ECA;&#x5929;&#xFF0C;&#x5404;&#x79CD;&#x65B0;&#x5E73;&#x53F0;&#x65B0;&#x65B9;&#x5F0F;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#x3002;
&#x76F8;&#x6BD4;&#x5FAE;&#x535A;&#xFF0C;&#x670B;&#x53CB;&#x5708;&#x7B49;&#x800C;&#x8A00;&#xFF0C;&#x535A;&#x5BA2;&#x5DF2;&#x7ECF;&#x4E0D;&#x5982;&#x4E4B;&#x524D;&#x90A3;&#x4E48;&#x6D41;&#x884C;&#x4E86;&#xFF0C;&#x5199;&#x535A;&#x5BA2;&#x7684;&#x4EBA;&#x597D;&#x50CF;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x5C0F;&#x4F17;&#x7684;&#x5708;&#x5B50;&#x3002;
</p>

<p>
&#x4F46;&#x662F;&#x535A;&#x5BA2;&#x8FD8;&#x662F;&#x6709;&#x5F88;&#x591A;&#x81EA;&#x5DF1;&#x72EC;&#x7279;&#x7684;&#x9B45;&#x529B;&#x548C;&#x4F18;&#x70B9;&#x7684;&#x3002;
&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x4E2A;&#x4EBA;&#x7684;&#x5C0F;&#x5929;&#x5730;&#xFF0C;&#x6709;&#x7740;&#x826F;&#x597D;&#x7684;&#x5206;&#x7C7B;&#x652F;&#x6301;&#x548C;&#x6F02;&#x4EAE;&#x7F8E;&#x89C2;&#x53D1;&#x754C;&#x9762;&#xFF0C;
&#x6216;&#x8005;&#x6DF1;&#x5165;&#x601D;&#x8003;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x6216;&#x8005;&#x5206;&#x4EAB;&#x81EA;&#x5DF1;&#x7684;&#x89C1;&#x5F97;&#xFF0C;&#x6216;&#x8005;&#x968F;&#x4FBF;&#x5199;&#x4E00;&#x4E9B;&#x968F;&#x7B14;&#xFF0C;
&#x90A3;&#x4E48;&#x535A;&#x5BA2;&#x662F;&#x4F60;&#x7684;&#x4E0D;&#x4E8C;&#x9009;&#x62E9;&#x3002;
</p>

<p>
&#x548C;&#x5FAE;&#x535A;&#x5BF9;&#x6BD4;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x5FAE;&#x535A;&#x7684;&#x5B57;&#x6570;&#x6709;&#x9650;&#x5236;&#x3002;
&#x8FD9;&#x70B9;&#x5B57;&#x5927;&#x6982;&#x4E5F;&#x53EA;&#x80FD;&#x7B80;&#x77ED;&#x7684;&#x63CF;&#x8FF0;&#x4E0B;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x50CF;&#x535A;&#x6587;&#x91CC;&#x7684;&#x6982;&#x8981;&#xFF0C;&#x60F3;&#x6DF1;&#x5165;&#x7684;&#x5C55;&#x5F00;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x4E0D;&#x884C;&#x4E86;&#x3002;
&#x800C;&#x4E14;&#x5FAE;&#x535A;&#x4E5F;&#x6CA1;&#x63D0;&#x4F9B;&#x592A;&#x597D;&#x7684;&#x7BA1;&#x7406;&#x65B9;&#x5F0F;&#x3002;&#x4F60;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x65F6;&#x95F4;&#x987A;&#x5E8F;&#x6765;&#x67E5;&#x770B;&#x4F60;&#x7684;&#x5FAE;&#x535A;&#x3002;
&#x4F46;&#x662F;&#x535A;&#x5BA2;&#x5C31;&#x597D;&#x591A;&#x4E86;&#xFF0C;&#x535A;&#x5BA2;&#x7684;&#x4E24;&#x5927;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#xFF0C;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x4F46;&#x662F;&#x53C8;&#x4E45;&#x7ECF;&#x8003;&#x9A8C;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5206;&#x7C7B;&#x548C;&#x6807;&#x7B7E;&#xFF08;tag&#xFF09;&#x3002;
&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x5FAE;&#x535A;&#x7684;&#x8FD9;&#x4E9B;&#x7279;&#x70B9;&#xFF0C;&#x662F;&#x4E2A;&#x793E;&#x4EA4;&#x5DE5;&#x5177;&#x3002;
&#x5982;&#x679C;&#x4F60;&#x8981;&#x662F;&#x60F3;&#x548C;&#x670B;&#x53CB;&#x4EEC;&#x5206;&#x4EAB;&#x4F60;&#x73B0;&#x5728;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#xFF0C;&#x548C;&#x670B;&#x53CB;&#x6B22;&#x5FEB;&#x7684;&#x4E92;&#x52A8;&#xFF0C;&#x4E86;&#x89E3;&#x4E00;&#x4E9B;&#x7B80;&#x77ED;&#x7684;&#x8D44;&#x8BAF;&#xFF0C;&#x90A3;&#x4E48;&#x5FAE;&#x535A;&#x4E4B;&#x7C7B;&#x662F;&#x5F88;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> &#x5199;&#x597D;&#x535A;&#x5BA2;&#x7684;&#x51E0;&#x4E2A;&#x8981;&#x70B9;</h2>
<div class="outline-text-2" id="text-3">
<p>
&#x524D;&#x9762;&#x63D0;&#x5230;&#x4E86;&#xFF0C;&#x535A;&#x5BA2;&#x7528;&#x6765;&#x7EC4;&#x7EC7;&#x535A;&#x6587;&#x7684;&#x65B9;&#x5F0F;&#x5F88;&#x7B80;&#x5355;&#x4F46;&#x662F;&#x5374;&#x5F88;&#x6709;&#x6548;&#x3002;
</p>
<ol class="org-ol">
<li>&#x5206;&#x7C7B;&#x3002; &#x6309;&#x7167;&#x535A;&#x6587;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x6BCF;&#x7BC7;&#x535A;&#x6587;&#x90FD;&#x8981;&#x6709;&#x4E2A;&#x5206;&#x7C7B;&#xFF0C;&#x800C;&#x4E14;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7684;&#x3002;
</li>
<li>&#x6807;&#x7B7E;&#x3002;&#x4F60;&#x7684;&#x535A;&#x6587;&#x867D;&#x7136;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x6D89;&#x53CA;&#x5230;&#x591A;&#x65B9;&#x9762;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x6BCF;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x7ED9;&#x5B83;&#x52A0;&#x4E2A;&#x6807;&#x7B7E;&#x3002;
</li>
</ol>
<p>
&#x8FD9;&#x4E24;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x770B;&#x4F3C;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x7528;&#x597D;&#x4E86;&#x4F1A;&#x8BA9;&#x4F60;&#x7684;&#x535A;&#x5BA2;&#x66F4;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F60;&#x81EA;&#x5DF1;&#x5728;&#x56DE;&#x987E;&#x65F6;&#x4E5F;&#x4F1A;&#x66F4;&#x6E05;&#x6670;&#xFF0C;&#x5BF9;&#x6D4F;&#x89C8;&#x8005;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x6307;&#x5F15;&#x3002;
</p>

<p>
&#x4E0A;&#x9762;&#x662F;&#x6709;&#x5173;&#x535A;&#x6587;&#x4E4B;&#x95F4;&#x7684;&#x7EC4;&#x7EC7;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x7BC7;&#x5177;&#x4F53;&#x7684;&#x535A;&#x6587;&#x6765;&#x8BF4;&#xFF0C;&#x60F3;&#x8981;&#x5199;&#x597D;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x5E94;&#x8BE5;&#x8981;&#xFF1A;
</p>
<ol class="org-ol">
<li>&#x5F00;&#x5934;&#x5199;&#x597D;&#x6458;&#x8981;&#x3002;&#x4E0D;&#x4EC5;&#x5BF9;&#x81EA;&#x5DF1;&#x6765;&#x8BF4;&#x662F;&#x4ECE;&#x5168;&#x5C40;&#x7684;&#x89D2;&#x5EA6;&#x5BF9;&#x535A;&#x6587;&#x7684;&#x4E00;&#x4E2A;&#x628A;&#x63E1;&#xFF0C;&#x4E5F;&#x80FD;&#x66F4;&#x597D;&#x7684;&#x8BA9;&#x8BFB;&#x8005;&#x4E86;&#x89E3;&#x535A;&#x6587;&#x3002;
</li>
<li>&#x5584;&#x4E8E;&#x5229;&#x7528;&#x597D;&#x5BCC;&#x6587;&#x6863;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5927;&#x7EB2;&#x529F;&#x80FD;&#x80FD;&#x5E2E;&#x52A9;&#x7EC4;&#x7EC7;&#x6587;&#x7AE0;&#x903B;&#x8F91;&#xFF0C;&#x52A0;&#x7C97;&#x529F;&#x80FD;&#x80FD;&#x7A81;&#x51FA;&#x91CD;&#x70B9;&#x3002;&#x800C;&#x4E14;&#x5BF9;&#x6587;&#x7AE0;&#x7F8E;&#x89C2;&#x4E5F;&#x5F88;&#x6709;&#x6548;&#x3002;
</li>
<li>&#x4FEE;&#x6539;&#x65F6;&#x5728;&#x6587;&#x7AE0;&#x672B;&#x5C3E;&#x52A0;&#x4E0A;&#x4FEE;&#x6539;&#x65E5;&#x5FD7;&#xFF0C;&#x9644;&#x4E0A;&#x4FEE;&#x6539;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x7B80;&#x8981;&#x7684;&#x8BF4;&#x660E;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#x4FEE;&#x6539;&#x3002;
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> &#x6301;&#x4E4B;&#x4EE5;&#x6052;&#x7684;&#x5199;&#x535A;&#x5BA2;</h2>
<div class="outline-text-2" id="text-4">
<p>
&#x867D;&#x7136;&#x73B0;&#x5728;&#x6EE1;&#x8154;&#x70ED;&#x60C5;&#xFF0C;&#x7075;&#x611F;&#x8FF8;&#x53D1;&#xFF0C;&#x4F46;&#x662F;&#x9B3C;&#x6653;&#x5F97;&#x7B49;&#x70ED;&#x60C5;&#x6D88;&#x9000;&#x540E;&#x53C8;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#xFF1F;
&#x575A;&#x6301;&#x8FD9;&#x4E2A;&#x8BCD;&#xFF0C;&#x5728;&#x6709;&#x70ED;&#x60C5;&#x7684;&#x65F6;&#x5019;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x6CA1;&#x52A8;&#x529B;&#x7684;&#x65F6;&#x5019;&#x6BD4;&#x6324;&#x7259;&#x818F;&#x8FD8;&#x96BE;&#x53D7;&#x3002;
</p>

<p>
&#x8D81;&#x7740;&#x6709;&#x7075;&#x611F;&#xFF0C;&#x6211;&#x5728;&#x8FD9;&#x91CC;&#x7ED9;&#x81EA;&#x5DF1;&#x51E0;&#x70B9;&#x63D0;&#x9192;&#xFF1A;
</p>
<ol class="org-ol">
<li>&#x6CA1;&#x52A8;&#x529B;&#x7684;&#x65F6;&#x5019; <b>&#x4E0D;&#x8981;</b> &#x903C;&#x81EA;&#x5DF1;&#xFF01;&#x90A3;&#x6837;&#x6CA1;&#x4EC0;&#x4E48;&#x7528;&#xFF0C;&#x81EA;&#x5DF1;&#x8D8A;&#x6765;&#x8D8A;&#x53CD;&#x611F;&#xFF0C;&#x6324;&#x7259;&#x818F;&#x5F0F;&#x7684;&#x8FD8;&#x5F04;&#x4E0D;&#x51FA;&#x4EC0;&#x4E48;&#x597D;&#x4E1C;&#x897F;&#x3002;
</li>
<li>&#x6709;&#x4E00;&#x4E9B;&#x535A;&#x6587;&#x662F;&#x6C34;&#x5230;&#x6E20;&#x6210;&#x7684;&#x3002;&#x4F60;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x4E86;&#x89E3;&#x7684;&#x6BD4;&#x8F83;&#x591A;&#x4E86;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6574;&#x7406;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x7B14;&#x8BB0;&#xFF0C;&#x91CD;&#x65B0;&#x7EC4;&#x7EC7;&#x8BED;&#x8A00;&#xFF0C;&#x4E00;&#x7BC7;&#x535A;&#x6587;&#x5C31;&#x51FA;&#x7089;&#x4E86;&#x3002;
</li>
<li>&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x535A;&#x6587;&#x662F;&#x9700;&#x8981;&#x7075;&#x611F;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x4F60;&#x7A81;&#x7136;&#x7075;&#x611F;&#x4E00;&#x95EA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6587;&#x601D;&#x6CC9;&#x6D8C;&#xFF0C;&#x4E0D;&#x8981;&#x72B9;&#x8C6B;&#xFF0C;&#x5FEB;&#x62FF;&#x7535;&#x8111;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF01;
</li>
<li>&#x535A;&#x5BA2;&#x754C;&#x9762;&#x5E94;&#x8BE5;&#x8981;&#x6F02;&#x4EAE;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x4F60;&#x6D4F;&#x89C8;&#x81EA;&#x5DF1;&#x535A;&#x5BA2;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5FC3;&#x60C5;&#x6109;&#x5FEB;&#xFF0C;&#x6210;&#x5C31;&#x611F;&#x98D9;&#x5347;&#xFF0C;&#x6FC0;&#x60C5;&#x53C8;&#x56DE;&#x6765;&#x4E86;&#xFF01;
</li>
<li>&#x751F;&#x6D3B;&#x4E2D;&#xFF0C;&#x59CB;&#x7EC8;&#x4FDD;&#x6301;&#x79EF;&#x6781;&#x7684;&#x5FC3;&#x6001;&#xFF0C;&#x6CE8;&#x610F;&#x6BCF;&#x4E00;&#x4E2A;&#x7EC6;&#x8282;&#xFF0C;&#x9F13;&#x52B1;&#x81EA;&#x5DF1;&#x591A;&#x591A;&#x601D;&#x8003;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x535A;&#x5BA2;&#x7075;&#x611F;&#x7684;&#x6765;&#x6E90;&#x3002;
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> &#x6700;&#x540E;</h2>
<div class="outline-text-2" id="text-5">
<p>
&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x5411;&#x7684;&#x4EBA;&#xFF0C;&#x4E5F;&#x4E0D;&#x61C2;&#x5F97;&#x6D6A;&#x6F2B;&#x3002;
&#x8C22;&#x8C22;&#x4F60;&#xFF0C;&#x80FD;&#x4E00;&#x76F4;&#x5BB9;&#x5FCD;&#x7740;&#x6211;&#x7684;&#x7F3A;&#x70B9;&#xFF0C;&#x800C;&#x6211;&#x4E5F;&#x5C06;&#x4E00;&#x76F4;&#xFF0C;&#x966A;&#x4F34;&#x7740;&#x4F60;&#xFF0C;&#x6C38;&#x8FDC;&#x8D70;&#x4E0B;&#x53BB;&#x3002;
</p>
</div>
</div>

      
    </div>
    <div class="article-info article-info-index">
      
      <a href="/2016/09/17/blog-starting/" class="archive-article-date">
  	<time datetime="2016-09-17T09:45:00.000Z" itemprop="datePublished"><i class="icon-clock"></i>2016-09-17</time>
</a>
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags"></i>
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/myself/">myself</a></li></ul>
	</div>

      
	<div class="article-category tagcloud">
	<i class="icon-price-tags"></i>
	<a class="article-category-link" href="/categories/博客/">博客</a>
	</div>


      <div class="clearfix"></div>
    </div>
  </div>
</article>

  
<nav id="article-nav">
  
  
    <a href="/2016/09/16/hexo-org-test/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">这是一篇使用 org-mode 书写的博文</div>
      <i class="icon-circle-right"></i>
    </a>
  
</nav>








<div class="duoshuo">
	<!-- 多说评论框 start -->
	<div class="ds-thread" data-thread-key="blog-starting" data-title="博客开张" data-url="http://frapples.github.io/2016/09/17/blog-starting/"></div>
	<!-- 多说评论框 end -->
	<!-- 多说公共JS代码 start (一个网页只需插入一次) -->
	<script type="text/javascript">
	var duoshuoQuery = {short_name:"frapples"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		 || document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
	<!-- 多说公共JS代码 end -->
</div>





      </div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2016 Frapples
    	</div>
      	<div class="footer-right">
      		<a href="http://hexo.io/" target="_blank">Hexo</a>  Theme <a href="https://github.com/litten/hexo-theme-yilia" target="_blank">Yilia</a> by Litten
      	</div>
    </div>
  </div>
</footer>
    </div>
    <script>
	var yiliaConfig = {
		fancybox: true,
		mathjax: true,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: false,
		root: "/"
	}
</script>

<script src="/./main.js"></script>





<script type="text/x-mathjax-config">
MathJax.Hub.Config({
    tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
    }
});

MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';                 
    }       
});
</script>

<script src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>


    
<div class="tools-col">
  <ul class="btn-wrap">
    
      <li class="chose" data-hook="tools-section-all"><span class="text">全部</span><i class="icon-book"></i></li>
    
    
      <li data-hook="tools-section-tag"><span class="text">标签</span><i class="icon-price-tags"></i></li>
    
    
    
      <li data-hook="tools-section-me"><span class="text">我</span><i class="icon-smile"></i></li>
    
  </ul>
  <div class="tools-wrap">
    
    	<section class="tools-section tools-section-all chose">
    	</section>
    

    
    	<section class="tools-section tools-section-tag">
    			<div class="widget tagcloud" id="js-tagcloud">
    				<a href="/tags/emacs/" style="font-size: 10px;">emacs</a> <a href="/tags/hexo/" style="font-size: 10px;">hexo</a> <a href="/tags/myself/" style="font-size: 10px;">myself</a> <a href="/tags/orgmode/" style="font-size: 10px;">orgmode</a>
    			</div>
    	</section>
    

    

    
    	<section class="tools-section tools-section-me">
  	  	
  	  		<div class="aboutme-wrap" id="js-aboutme">热爱技术，热爱知识的大学生一枚。&lt;br&gt;&lt;br&gt;自己的一片小天地。&lt;br&gt;在这里整理自己的思绪，分享自己的心得。</div>
  	  	
    	</section>
    
  </div>
  
</div>
    <!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">

    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>

    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">

        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>

        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">

            <div class="pswp__top-bar">

                <!--  Controls are self-explanatory. Order can be changed. -->

                <div class="pswp__counter"></div>

                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>

                <button class="pswp__button pswp__button--share" title="Share"></button>

                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>

                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>

                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                      <div class="pswp__preloader__cut">
                        <div class="pswp__preloader__donut"></div>
                      </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div> 
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>

        </div>

    </div>

</div>
  </div>
</body>
</html>